Revit 2024 API
CanExecuteEventArgs Class
The event arguments used by AddInCommandBinding's CanExecute event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class CanExecuteEventArgs : CommandEventArgs
Visual Basic
Public Class CanExecuteEventArgs _
	Inherits CommandEventArgs
Visual C++
public ref class CanExecuteEventArgs : public CommandEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.UI.Events.CommandEventArgs
 Autodesk.Revit.UI.Events.CanExecuteEventArgs
See Also
CanExecuteEventArgs Members
Autodesk.Revit.UI.Events Namespace